[
  {
    "Id": "101471",
    "ThreadId": "30455",
    "Html": "At first let me say: a real great tool and required long ago.<br>\r\n<br>\r\nI've two simple questions:<br>\r\n<ol>\r\n    <li>It is possible to add a hyperlink field&nbsp;to the&nbsp;interlocking msdn entry eg. <em>functio</em>n: <strong>CreateService</strong><em> link</em>:&nbsp;<a href=\"http://msdn.microsoft.com/ms682450.aspx\">http://msdn.microsoft.com/ms682450.aspx</a><br>\r\n    It would be very helpfull in some situations where the user is not really shure what unmanaged type he should use.</li>\r\n    <li>Is there any intended&nbsp;way to extend the given <em>windows.xml</em> with some entries? A UI-based solution, maybe another tab in the <em>winsiggen.exe</em>, could be a possible way. I ask this, because the structure of the <em>windows.xml</em> looks very complex to me.&nbsp;A tool who manages the different Id's in a correct way would be very helpfull.</li>\r\n</ol>\r\n<p>Thans again to share this great toolkit with us.<br>\r\n<br>\r\nServus,<br>\r\nKlaus</p>\r\n",
    "PostedDate": "2008-06-29T06:15:21.95-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "101976",
    "ThreadId": "30455",
    "Html": "Hi klaus_b,<br>\r\n<br>\r\nThanks for the feedback.&nbsp; <br>\r\n<br>\r\n1) I like this idea.&nbsp; The issue is how given a function name can we generate an URL.&nbsp; If there is a predictable way this would be pretty easy to add to the tool?<br>\r\n<br>\r\n2) Yes and no.&nbsp; There is no supported way through the UI to extend the file.&nbsp; However the command line version of the tool has the ability to generate an XML file instead of the raw code.&nbsp; This XML file is the same format as windows.xml (in fact we use the tool to generate windows.xml).&nbsp; You can use this option to generate a new windows.xml file and simply replace the original windows.xml in the install location.&nbsp; If we get enough feedback on this I'll try and add it as a first level feature.&nbsp; <br>\r\n<br>\r\nJared<br>\r\n<a href=\"http://blogs.msdn.com/jaredpar\">http://blogs.msdn.com/jaredpar</a>\r\n",
    "PostedDate": "2008-07-01T12:47:23.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "102053",
    "ThreadId": "30455",
    "Html": "Hi Jared,<br>\r\n<br>\r\n<div style=\"border-right:medium none;padding-right:0.2em;border-top:#aaa 0.1em dotted;padding-left:0.2em;padding-bottom:0.2em;margin:1em 0em 2.5em 3em;border-left:medium none;padding-top:0.2em;border-bottom:#aaa 0.1em dotted;font-style:italic\"><br>\r\njaredp110680 wrote:<br>\r\n<br>\r\nIf there is a predictable way this would be pretty easy to add to the tool?<br>\r\n<br>\r\n</div>\r\n<p>To start from scratch i'll say: use the life search API.<br>\r\nTo stay on the sample from&nbsp;my first post&nbsp;search for [CreateService Function site:msdn2.microsoft.com]. The search returns the title:&nbsp;<strong>CreateService Function (Windows)</strong>&nbsp;and the&nbsp;URL:&nbsp; <a href=\"https://msdn2.microsoft.com/en-us/library/ms682450.aspx\">https://msdn2.microsoft.com/en-us/library/ms682450.aspx</a>&nbsp;in the first result&nbsp;row.&nbsp;Now cout out the localization and the library part and you have the pure URL you can use. To create the search string you have all you need. The name and the type of the API member is given.<br>\r\nThats only a first suggestion. I'm shure you find some better ones.<br>\r\n<br>\r\nKlaus</p>\r\n",
    "PostedDate": "2008-07-01T22:16:33.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]