[
  {
    "Id": "170587",
    "ThreadId": "50903",
    "Html": "As a toolkit supplier I need to make life as easy as possible for my own customers, which means giving them <strong>one</strong> DLL to use, rather than a collection.  So, I try to incorporate all source into a single DLL.  For AxImp, I can use the <strong>/source</strong> option to give me C# source code which I can then incorporate into my project, and it is a huge shame to find that I still need to ship and support a separate DLL for the underlying COM object (as generated by TlbImp).  <strong>Please</strong> could TlbImp be brought up to the usability standard of AxImp (they are, after all, an otherwise matching pair) by providing a /source option? \r\n",
    "PostedDate": "2009-03-22T10:50:14.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "171311",
    "ThreadId": "50903",
    "Html": "Thank you for your suggestion. I believe your real problem is that you want to avoid shipping separate DLL. In the upcoming .NET 4.0 release, you can now embed interop types from interop assemblies (generated by TlbImp) into your own assemblies. As a result, the interop assembly is only needed at build time, not runtime. This feature is called Type Equivalency, or NO PIA. For more information, please can visit Misha's blog at : <a href=\"http://blogs.msdn.com/mshneer/\">http://blogs.msdn.com/mshneer/</a><br>\r\n<br>\r\nThanks!\r\n",
    "PostedDate": "2009-03-24T07:06:22.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "171643",
    "ThreadId": "50903",
    "Html": "Thanks Medconn again! I put the request into our product backlog and we will consider it in our future relase. Currently, if you do not have the v4 runtime to try the Type Equivalency you may wrok around the issue in il code. I mean ildasm our interop assembly and ilasm it with other il code disassembled from your own assembly.\r\n",
    "PostedDate": "2009-03-24T18:33:24.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]